Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
/* 
 * File:   sensepi_cam_trigger.c
 * Copyright (c) 2018 Appiko
 * Created on 14 August, 2018, 5:42 PM
 * Author:  Tejas Vasekar (https://github.com/tejas-tj)
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 * this list of conditions and the following disclaimer in the documentation
 * and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its contributors
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF 
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE
 */

#include "sensepi_cam_trigger.h"

#include "sensepi_ble.h"

#include "pir_sense.h"
#include "led_sense.h"
#include "mcp4012_x.h"
#include "ms_timer.h"
#include "led_ui.h"
#include "out_pattern_gen.h"
#include "log.h"

#include "hal_pin_analog_input.h"
#include "hal_nop_delay.h"
#include "hal_gpio.h"

#include "nrf_util.h"
#include "nrf_assert.h"
#include "common_util.h"

#include "stdint.h"
#include "stdbool.h"
#include "string.h"

#include "boards.h"

#define DEBUG_PRINT 0

/**Delay required when LED is to be used as INPUT*/
#define LED_WAIT_TIME_MS 301
/**Minimum time required to enable PIR sensing*/
#define PIR_SENSE_INTERVAL_MS 50
/** Multiplying factor to convert PIR threshold value received from app to one 
 *  appropriate for module  */
#define PIR_THRESHOLD_MULTIPLY_FACTOR 8
/** Multiplying factor to convert Light threshold value received from app to one 
 *  appropriate for module  */
#define LIGHT_THRESHOLD_MULTIPLY_FACTOR 32
/** The time in ms (min*sec*ms) after which light sensing is to be done */
#define LIGHT_SENSE_INTERVAL_MS   (5*60*1000)
/** The time in ms timer ticks after which light sensing is to be done */
#define LIGHT_SENSE_INTERVAL_TICKS (MS_TIMER_TICKS_MS(LIGHT_SENSE_INTERVAL_MS))
/** The time in ms (min*sec*ms) to show feedback with the LED
 *  pulsing in the Sense mode */
#define SENSE_FEEDBACK_TIMEOUT_MS   (9.8*60*1000)
/** The time in ms timer ticks to show feedback with the LED
 *  pulsing in the Sense mode */
#define SENSE_FEEDBACK_TIMEOUT_TICKS (MS_TIMER_TICKS_MS(SENSE_FEEDBACK_TIMEOUT_MS))
/** MS_TIMER used in this module */
#define SENSEPI_CAM_TRIGGER_MS_TIMER_USED MS_TIMER2
/*Data_Process module MACROS*/
/** Number of output pins used */
#define NUM_PIN_OUT 2
/** Size of 1 byte in bits */
#define SIZE_OF_BYTE 8
/** Byte position of MODE in 32 bit uint variable */
#define MODE_POS 0
/** Byte position of INPUT1 in 32 bit uint variable */
#define INPUT1_POS 1
/** Byte position of INPUT2 in 32 bit uint variable */
#define INPUT2_POS 3
/** Mask to separate MODE from rest of the data */
#define MODE_MSK 0x000000FF
/** Mask to separate INPUT1 from rest of the data */
#define INPUT1_MSK 0x00FFFF00
/** Mask to separate INPUT2 from rest of the data */
#define INPUT2_MSK 0xFF000000

/** Number of transitions required for single shot operation */
#define SINGLE_SHOT_TRANSITIONS 2
/** Ticks duration required for single shot operation */
#define SINGLE_SHOT_DURATION MS_TIMER_TICKS_MS(250)
/** Number of transitions required for bulb operation */
#define BULB_SHOT_TRANSITIONS 3
/** Ticks duration of trigger pulse at the end of operation */
#define BULB_TRIGGER_PULSE MS_TIMER_TICKS_MS(250)
/** Number of transitions required for focus operation */
#define FOCUS_TRANSITIONS 2
/** Number of transitions required for Video operation triggered by Timer */
#define TIMER_VIDEO_TRANSITIONS 3
/** Ticks duration of trigger pulse to start a video */
#define VIDEO_START_PULSE MS_TIMER_TICKS_MS(250)
/** Ticks duration of trigger pulse to end a video */
#define VIDEO_END_PULSE MS_TIMER_TICKS_MS(300)
/** Number of maximum extensions for Video */
#define NO_OF_VIDEO_EXTN_ALLOWED 3
/** Duration for which PIR will be active for video extension */
#define VIDEO_PIR_ON 2000

/**
 * @brief Enum of different types of camera triggering.
 */
typedef enum 
{
    /** Click single shot per trigger */
    MODE_SINGLE_SHOT,
    /** Click multiple shot per trigger */
    MODE_MULTISHOT,
    /** Click shot in bulb mode */
    MODE_BULB,
    /** Shoot video with start and stop pulse */
    MODE_VIDEO,
    /** Focus only */
    MODE_FOCUS,
    /** Mode dedicated to do nothing */
    MODE_NONE,
} 
operational_mode_t;

/** 
 * @brief Enum of different states of camera trigger
 */
typedef enum
{
    PIR_IDLE,
    TIMER_IDLE,
    VIDEO_IDLE,
    MAX_STATES,
}
cam_trig_state_t;

/** Copy of configuration to be shared across module */
static sensepi_cam_trigger_init_config_t config;
/** PIR configuration which will be used to enable PIR */
static pir_sense_cfg config_pir;
/** Array of out_gen_config_t to store pre-calculated configs */
static out_gen_config_t out_gen_config[MAX_STATES];
/***/
static out_gen_config_t video_ext_config;
static uint32_t video_extn_ticks;
/** Flag to keep status of PIR's expected state */
static bool pir_on_flag = false;
/** The amount of time since starting the SENSING state */
static uint32_t sense_count;
/** Boolen to indicate if PIR sensing feedback is required for user  */
static bool sense_feedback = false;
/***/
static const bool out_gen_end_all_on[OUT_GEN_MAX_NUM_OUT] = {1,1,1,1};
/***/
static const bool multishot_generic[OUT_GEN_MAX_NUM_OUT][OUT_GEN_MAX_TRANSITIONS] =
    {
            {0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1},
            {0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1},
            {0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1},
            {0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1}
    };

/*PIR related functions*/
/**
 * @brief Function to enable or disable PIR according to conditions
 * @param state if true enable the PIR if false disable the PIR
 */
void pir_set_state(bool state);
/**
 * @brief IRQ Handler for PIR interrupt
 */
void pir_handler(int32_t adc_val);
/**
 * @brief PIR handler for Video mode
 * @param adc_val
 */
void pir_handler_video(int32_t adc_val);
/**
 * @brief Function to update the out_gen_configs for PIR.
 */
void pir_out_gen_config_updater(void);

/*Timer related functions*/
/**
 * @brief Function to enable or disable timer according to conditions
 * @param state if true enable the timer if false disable the timer
 */
void timer_set_state(bool state);
/**
 * @brief IRQ Handler for periodic TIMER interrupt
 */
void timer_handler(void);
/**
 * @brief Function to update the out_gen_configs for Timer.
 */
void timer_out_gen_config_updater(void);

