Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
/*out_pattern_gen related functions*/
/**
 * @brief Handler for out pattern generation done.
 * @param out_gen_state State from which handler is called.
 */
void pattern_out_done_handler(uint32_t out_gen_state);

/*Light Sense related functions*/
/**
 * @brief Function to get required data to initialize the led_sense module
 */
void light_sense_init(void);
/**
 * @brief Function to enable or disable light_sense according to conditions
 * @param state if true enable the light_sense if false disable the light_sense
 */
void light_sense_set_state(bool state);
/**
 * @brief Function which will check light intensity and compare it to 
 * current operational mode sent as parameter.
 * @param oper_time value for which we need to check light conditions
 * @return true if light intensity satisfies given conditions
 * @return false if light intensity doesn't satisfies given condition
 */
bool light_sense_light_check(oper_time_t oper_time);

/*Module manager related function*/
//Module manager is part of program which will enable or disable the 
//PIR or timer at start event, add_ticks event and stop event
/**
 * @brief Function to check light and working mode conditions.
 * according to conditions respective peripheral device will be
 * enabled or disabled.
 */
void module_manager_start_check(void);
/**
 * @brief Function to disable all peripheral device used in this module.
 */
void module_manager_disable_all(void);

/**
 * @brief Functions to generate out_gen_config according to selected camera
 * trigger mode.
 * @{
 */
/**
 * @brief Function to click one shot per trigger
 * @param data_process_mode mode for which we have to generate the out_gen_config
 */
void single_shot_mode(cam_trig_state_t data_process_mode);
/**
 * @brief Function to click multiple shots per trigger
 * @param data_process_mode mode for which we have to generate the out_gen_config
 * @param burst_duration Time duration between two shots
 * @param burst_num Number of shots per trigger
 */
void multi_shot_mode(cam_trig_state_t data_process_mode, 
                     uint32_t burst_duration, uint32_t burst_num);
/**
 * @brief Function to take photo in bulb mode.
 * @param data_process_mode mode for which we have to generate the out_gen_config
 * @param bulb_time Time duration for half press signal
 */
void bulb_mode(cam_trig_state_t data_process_mode, uint32_t bulb_time);
/**
 * @brief Function to do focus only
 * @param data_process_mode mode for which we have to generate the out_gen_config
 */
void focus_mode(cam_trig_state_t data_process_mode);
/**
 * @brief Dummy mode which will do nothing i.e keep the signals high
 * @param data_process_mode mode for which we have to generate the out_gen_config
 */
void none_mode(cam_trig_state_t data_process_mode);
//Suggest some good name for this function.
/**
 * @brief Function to create out_gen_config for the video length for which
 * PIR will be enabled.
 * @param ext_mode
 */
void pir_video_end();
/**
 * @brief Function to generate out_gen_config required for extension length
 * @param extn_len
 */
void pir_video_extn(uint32_t extn_len);
/**
 * @brief Function to start the video on PIR triggering
 * @param pir_video_mode
 * @param ext_mode
 * @param video_len
 * @param ext_len
 */
void pir_video_mode(uint32_t video_len);
/**
 * @brief Function to record video of fix length on Timer Triggering
 * @param timer_video_mode
 * @param video_len
 */
void timer_video_mode(uint32_t video_len);

//function definitions
/**
 * @brief Function to print expected pattern output from out_gen_pattern
 * @param next Array of expected states
 * @param str Comment to describe for which we are printing the array.
 */
void debug_print_bool_array(bool (* next)[OUT_GEN_MAX_TRANSITIONS], char * str)
{
#if DEBUG_PRINT
    log_printf("%s\n", str);
    for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
    {
        for(uint32_t arr_p = 0; arr_p<OUT_GEN_MAX_TRANSITIONS; arr_p++)
        {
            log_printf("%x ", next[row][arr_p]);
        }
        log_printf("\n");
    }
    log_printf("\n");
#endif
}

void pir_set_state(bool state)
{
    log_printf("%s %x\n",__func__, state);
    if(state == true)
    {
        pir_sense_start(&config_pir);        
    }
    else
    {
        pir_sense_stop();    
    }
}

void pir_handler(int32_t adc_val)
{
    log_printf("%s", __func__);
    log_printf(" %d\n", adc_val);
    pir_set_state(false);
    if(out_gen_is_on() == false)
    {
        if(sense_feedback == true)
        {
            led_ui_single_start(LED_SEQ_PIR_PULSE, LED_UI_HIGH_PRIORITY, true);
        }
        out_gen_start(&out_gen_config[PIR_IDLE]);
    }
}

void pir_handler_video(int32_t adc_val)
{
    log_printf("%s", __func__);
    log_printf(" %d\n", adc_val);
    pir_set_state(false);
    static uint32_t no_of_extn_remain;
    if(out_gen_is_on() == false)
    {
        if(sense_feedback == true)
        {
            led_ui_single_start(LED_SEQ_PIR_PULSE, LED_UI_HIGH_PRIORITY, true);
        }
        no_of_extn_remain = NO_OF_VIDEO_EXTN_ALLOWED;
        out_gen_start(&out_gen_config[PIR_IDLE]);
    }
    else if(no_of_extn_remain > 0)
    {
        video_ext_config.transitions_durations[0] = 
            (video_extn_ticks  - out_gen_get_ticks())
            & 0xFFFFFF;
        out_gen_start(&video_ext_config);
        no_of_extn_remain--;
    }
}

void pir_out_gen_config_updater()
{
    uint32_t config_mode = config.config_sensepi->pir_conf.mode;
    uint32_t mode = ((config_mode & MODE_MSK) 
            >> (MODE_POS * SIZE_OF_BYTE));
    uint32_t input1 = ((config_mode & INPUT1_MSK) 
            >> (INPUT1_POS * SIZE_OF_BYTE));
    uint32_t input2 = ((config_mode & INPUT2_MSK) 
            >> (INPUT2_POS * SIZE_OF_BYTE));
    uint32_t single_input = config_mode>> (INPUT1_POS * SIZE_OF_BYTE);
    switch((operational_mode_t)mode)
    {
        case MODE_SINGLE_SHOT:
        {
            single_shot_mode(PIR_IDLE);
            break;
        }
        case MODE_MULTISHOT:
        {
            multi_shot_mode(PIR_IDLE, input1, input2);
            break;
        }
        case MODE_BULB :
        {
            //Using both input 1 and input 2
            bulb_mode(PIR_IDLE, single_input);
            break;
        }
        case MODE_VIDEO :
        {
            pir_video_mode(input1);
            pir_video_extn(input2);
            pir_video_end();
            break;
        }
        case MODE_FOCUS :
        {
            focus_mode(PIR_IDLE);
            break;
        }
        case MODE_NONE:
        {
            none_mode(PIR_IDLE);
        }
    }   
}

void timer_set_state(bool state)
{
    if(state == true)
    {
        if(ms_timer_get_on_status (SENSEPI_CAM_TRIGGER_MS_TIMER_USED) == false)
        {
            ms_timer_start(SENSEPI_CAM_TRIGGER_MS_TIMER_USED, MS_REPEATED_CALL,
               MS_TIMER_TICKS_MS(config.config_sensepi->timer_conf.timer_interval * 100),
               timer_handler);
        }
    }
    else
    {
        ms_timer_stop(SENSEPI_CAM_TRIGGER_MS_TIMER_USED);
    }
}

void timer_handler()
{
    if(out_gen_is_on () == false)
    {
        out_gen_start(&out_gen_config[TIMER_IDLE]);
    }
}

void timer_out_gen_config_updater(void)
{
    uint32_t config_mode = config.config_sensepi->timer_conf.mode;
    uint32_t mode = ((config_mode & MODE_MSK) 
            >> (MODE_POS * SIZE_OF_BYTE));
    uint32_t input1 = ((config_mode & INPUT1_MSK) 
            >> (INPUT1_POS * SIZE_OF_BYTE));
    uint32_t input2 = ((config_mode & INPUT2_MSK) 
            >> (INPUT2_POS * SIZE_OF_BYTE));
    uint32_t single_input = config_mode>> (INPUT1_POS * SIZE_OF_BYTE);
    switch((operational_mode_t)mode)
    {
        case MODE_SINGLE_SHOT:
        {
            single_shot_mode(TIMER_IDLE);
            break;
        }
        case MODE_MULTISHOT:
        {
            multi_shot_mode(TIMER_IDLE, input1, input2);
            break;
        }
        case MODE_BULB :
        {
            //Using both input 1 and input 2
            bulb_mode(TIMER_IDLE, single_input);
            break;
        }
        case MODE_VIDEO :
        {
            timer_video_mode(input1);
            break;
        }
        case MODE_FOCUS :
        {
            focus_mode(TIMER_IDLE);
            break;
        }
        case MODE_NONE:
        {
            none_mode(PIR_IDLE);
        }
    }   
}

void pattern_out_done_handler (uint32_t out_gen_state)
{
    log_printf("%s",__func__);
    log_printf(" %d\n", out_gen_state);
    switch((cam_trig_state_t)out_gen_state)
    {
        case PIR_IDLE :
        {
            pir_set_state(pir_on_flag);
            break;
        }
        case TIMER_IDLE : 
        {
            break;
        }
        case VIDEO_IDLE :
        {
            out_gen_start(&out_gen_config[VIDEO_IDLE]);
            pir_set_state(pir_on_flag);
            break;
        }
        case MAX_STATES : 
        {
            log_printf("Something went seriously wrong..!!\n");
            break;
        }
    }
}

void light_sense_init(void)
{
    log_printf("%s\n",__func__);
    led_sense_init (config.led_sense_out_pin,
                    config.led_sense_analog_in_pin,
                    config.led_sense_off_val);
}

void light_sense_set_state(bool state)
{
    if(state == true)
    {
        led_sense_cfg_input(true);
        //To make sure that the green LED is ready to sense light
        hal_nop_delay_ms(LED_WAIT_TIME_MS);
    }
    else
    {
        led_sense_cfg_input(false);
    }
}

bool light_sense_light_check(oper_time_t oper_time)
{
    log_printf("%d\n", __func__);

    uint8_t light_sense_config = oper_time.day_or_night;
    uint32_t light_threshold =
            (uint32_t)((oper_time.threshold) * LIGHT_THRESHOLD_MULTIPLY_FACTOR);

    uint32_t light_intensity = led_sense_get();
    log_printf("Light Intensity : %d\n", light_intensity);

    static bool light_check_flag = 0;
    //Day and its brighter than the threshold
    if(((light_sense_config == 1) && (light_intensity >= light_threshold))
            ||  //Night and its dimmer than the threshold
       ((light_sense_config == 0) && (light_intensity <= light_threshold)))
    {
        light_check_flag = 1;
    }
    else
    {
        light_check_flag = 0;
    }
    return light_check_flag;
}

