Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
void module_manager_start_check(void)
{
    log_printf("%s\n", __func__);
    //Switch off PIR module so that light sensing can happen
    pir_set_state(false);
    bool light_flag;
    switch(config.config_sensepi->trig_conf)
    {
        case PIR_ONLY : 
        {
            light_flag = light_sense_light_check(config.config_sensepi->pir_conf.oper_time);
            pir_on_flag = light_flag;
            pir_set_state(light_flag);
            
            break;
        }
        case TIMER_ONLY : 
        {
            light_flag = light_sense_light_check(config.config_sensepi->timer_conf.oper_time);
            timer_set_state(light_flag);
                    
            break;
        }
        case PIR_AND_TIMER :
        {
            light_flag = light_sense_light_check(config.config_sensepi->pir_conf.oper_time);
            pir_on_flag = light_flag;
            pir_set_state(light_flag);

            light_flag = light_sense_light_check(config.config_sensepi->timer_conf.oper_time);
            timer_set_state(light_flag);

            break;
        }
    }

}

void module_manager_disable_all(void)
{
    pir_set_state(false);
    timer_set_state(false);
    light_sense_set_state(false);
}

void single_shot_mode(cam_trig_state_t data_process_mode)
{
    log_printf("%s\n", __func__);
    uint32_t number_of_transition = SINGLE_SHOT_TRANSITIONS;
    int32_t time_remain;

    if(data_process_mode == PIR_IDLE)
    {
        time_remain = MS_TIMER_TICKS_MS(config.config_sensepi->pir_conf.intr_trig_timer * 100) 
            - (SINGLE_SHOT_DURATION); 
        if((int32_t)time_remain <= 0)
        {
            time_remain = 0;
        }
    }
    else if(data_process_mode == TIMER_IDLE)
    {
        time_remain = 0;
    }

    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = data_process_mode,
        .transitions_durations = { SINGLE_SHOT_DURATION, time_remain },
        .next_out = {{0, 1, 1},
                     {0, 1, 1}},
    };

    debug_print_bool_array(local_out_gen_config.next_out, "single shot");
    memcpy(&out_gen_config[data_process_mode],&local_out_gen_config,
           sizeof(out_gen_config_t));
}

void multi_shot_mode(cam_trig_state_t data_process_mode, 
                     uint32_t burst_duration, uint32_t burst_num)
{
    log_printf("%s\n", __func__);
    int32_t time_remain;
    uint32_t number_of_transition = SINGLE_SHOT_TRANSITIONS * burst_num;
    //Time for trigger pulse and time till next trigger for each burst
    uint32_t repeat_delay_array[SINGLE_SHOT_TRANSITIONS] = {SINGLE_SHOT_DURATION,
            MS_TIMER_TICKS_MS(burst_duration * 100) - SINGLE_SHOT_DURATION};
    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = data_process_mode,
    };

    for(uint32_t i = 0; i< burst_num; i++)
    {
        memcpy(local_out_gen_config.transitions_durations + i*SINGLE_SHOT_TRANSITIONS,
                repeat_delay_array, SINGLE_SHOT_TRANSITIONS*sizeof(uint32_t));

        for(uint32_t j = 0; j < NUM_PIN_OUT; j++)
        {
            memcpy(*(local_out_gen_config.next_out +j),*(multishot_generic + j),
                    burst_num* SINGLE_SHOT_TRANSITIONS*sizeof(bool));
            //An extra '1' at the end for the remaining of the inter-trigger time
            local_out_gen_config.next_out[j][burst_num* SINGLE_SHOT_TRANSITIONS] = 1;
        }
    }

    if(data_process_mode == PIR_IDLE)
    {
        time_remain = MS_TIMER_TICKS_MS(config.config_sensepi->pir_conf.intr_trig_timer * 100)
            - SINGLE_SHOT_DURATION*burst_num -
            (MS_TIMER_TICKS_MS(burst_duration * 100) - SINGLE_SHOT_DURATION)*(burst_num - 1);  
        if((int32_t)time_remain <= 0)
        {
            time_remain = 1;
        }
   }
    else if(data_process_mode == TIMER_IDLE)
    {
        time_remain = 1;
    }
    // Last interval for the '1' signal till 'time till next trigger' elapses
    local_out_gen_config.transitions_durations[number_of_transition-1] = time_remain;
            

    debug_print_bool_array(local_out_gen_config.next_out, "multi shot");
    memcpy(&out_gen_config[data_process_mode], &local_out_gen_config,
           sizeof(out_gen_config_t));
}

void bulb_mode(cam_trig_state_t data_process_mode, uint32_t bulb_time)
{
    log_printf("%s\n", __func__);
    int32_t time_remain;
    uint32_t number_of_transition = BULB_SHOT_TRANSITIONS;
    uint32_t bulb_time_ticks = MS_TIMER_TICKS_MS((bulb_time*100));

    if(data_process_mode == PIR_IDLE)
    {
        time_remain = MS_TIMER_TICKS_MS(config.config_sensepi->pir_conf.intr_trig_timer * 100)
            - bulb_time_ticks ;
        if((int32_t)time_remain <= 0)
        {
            time_remain = 1;
        }
    }
    else if(data_process_mode == TIMER_IDLE)
    {
        time_remain = 0;
    }

    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = data_process_mode,
        .transitions_durations = 
            {bulb_time_ticks - BULB_TRIGGER_PULSE, BULB_TRIGGER_PULSE
              , time_remain},
        .next_out = { {0, 0, 1, 1},
                      {1, 0, 1, 1} },
    };

    debug_print_bool_array(local_out_gen_config.next_out, "bulb mode");
    memcpy(&out_gen_config[data_process_mode],&local_out_gen_config,
           sizeof(out_gen_config_t));
}

void timer_video_mode(uint32_t video_len)
{
    int32_t time_remain = config.config_sensepi->timer_conf.timer_interval*100 -
        video_len*100 - 500;
    if(time_remain > 0)
    {
        out_gen_config_t local_out_gen_config =
        {
            .num_transitions = TIMER_VIDEO_TRANSITIONS,
            .next_out = {{0,1,0,1},
                {1,1,1,1}},
            .transitions_durations = {VIDEO_START_PULSE,
                        (MS_TIMER_TICKS_MS(video_len*100) - VIDEO_START_PULSE),
                        VIDEO_END_PULSE},
            .out_gen_done_handler = pattern_out_done_handler,
            .out_gen_state = TIMER_IDLE,
           
