Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
        };
        debug_print_bool_array(local_out_gen_config.next_out, "Timer video mode");
        memcpy(&out_gen_config[TIMER_IDLE],&local_out_gen_config,
               sizeof(out_gen_config_t));

    }
   
}

void pir_video_mode(uint32_t video_len)
{
    config_pir.handler = pir_handler_video;
    video_len = (video_len * 1000) - VIDEO_PIR_ON;
    out_gen_config_t local_out_gen_config =
    {
        .num_transitions = SINGLE_SHOT_TRANSITIONS,
        .next_out = {{0,1,1}
        ,{1,1,1}},
        .transitions_durations = {VIDEO_START_PULSE, 
                                    (MS_TIMER_TICKS_MS(video_len) - VIDEO_START_PULSE)},
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = VIDEO_IDLE,
    };
    debug_print_bool_array(local_out_gen_config.next_out, "PIR video mode");
    memcpy(&out_gen_config[PIR_IDLE],&local_out_gen_config,
           sizeof(out_gen_config_t));    
}

void pir_video_extn (uint32_t extn_len)
{
    video_extn_ticks = MS_TIMER_TICKS_MS(extn_len * 1000);
    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = 1,
        .next_out = {{1,1}, {1,1}},
        .transitions_durations = {video_extn_ticks},
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = VIDEO_IDLE,
    };
    debug_print_bool_array(local_out_gen_config.next_out, "PIR video extension");
    memcpy(&video_ext_config,&local_out_gen_config,
           sizeof(out_gen_config_t));    
    
}

void pir_video_end()
{
    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = SINGLE_SHOT_TRANSITIONS,
        .next_out = {{1,0,1},
            {1,1,1}},
        .transitions_durations = {MS_TIMER_TICKS_MS(VIDEO_PIR_ON), VIDEO_END_PULSE,},
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = PIR_IDLE,
    };
    debug_print_bool_array(local_out_gen_config.next_out, "PIR video mode");
    memcpy(&out_gen_config[VIDEO_IDLE],&local_out_gen_config,
           sizeof(out_gen_config_t)); 
}

void focus_mode(cam_trig_state_t data_process_mode)
{
    log_printf("%s\n", __func__);
    int32_t time_remain;
    uint32_t number_of_transition = FOCUS_TRANSITIONS;

    if(data_process_mode == PIR_IDLE)
    {
        time_remain =  MS_TIMER_TICKS_MS(config.config_sensepi->pir_conf.intr_trig_timer * 100)
            - SINGLE_SHOT_DURATION ;
        if((int32_t)time_remain <= 0)
        {
            time_remain = 1;
        }
    }
    else if(data_process_mode == TIMER_IDLE)
    {
        time_remain = 1;
    }

    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = data_process_mode,
        .transitions_durations =
        {SINGLE_SHOT_DURATION ,time_remain},
        .next_out = { {0, 1, 1},
                      {1, 1, 1} },
    };
    
    debug_print_bool_array(local_out_gen_config.next_out, "focus mode");
    memcpy(&out_gen_config[data_process_mode],&local_out_gen_config,
           sizeof(out_gen_config_t));
}

void none_mode(cam_trig_state_t data_process_mode)
{
    out_gen_config_t local_out_gen_config =
    {
        .num_transitions = 1,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = data_process_mode,
        .transitions_durations = {1},
        .next_out = { {1},
                      {1} },
    };

    memcpy(&out_gen_config[data_process_mode],&local_out_gen_config,
           sizeof(out_gen_config_t));
}

void sensepi_cam_trigger_init(sensepi_cam_trigger_init_config_t * config_sensepi_cam_trigger)
{
    log_printf("%s\n", __func__);
    ASSERT(config_sensepi_cam_trigger->signal_pin_num == NUM_PIN_OUT);
    memcpy(&config, config_sensepi_cam_trigger, sizeof(config));
    light_sense_init();
    mcp4012_init(config.amp_cs_pin, config.amp_ud_pin, config.amp_spi_sck_pin);
    pir_sense_cfg local_config_pir = 
    {
        PIR_SENSE_INTERVAL_MS, config.pir_sense_signal_input,
        config.pir_sense_offset_input,
        ((uint32_t)config.config_sensepi->pir_conf.threshold)*PIR_THRESHOLD_MULTIPLY_FACTOR,
        APP_IRQ_PRIORITY_HIGH, pir_handler, 
    };
    memcpy(&config_pir, &local_config_pir, sizeof(pir_sense_cfg));
    out_gen_init(NUM_PIN_OUT, config.signal_out_pin_array, 
                 (bool *) out_gen_end_all_on);
}

void sensepi_cam_trigger_update(sensepi_config_t * update_config)
{
    log_printf("%s\n", __func__);
    memcpy(config.config_sensepi, update_config, sizeof(sensepi_config_t));
}

void sensepi_cam_trigger_start()
{
    log_printf("%s\n", __func__);

    sense_count = 0;
    sense_feedback = true;

    config_pir.threshold = ((uint32_t) config.config_sensepi->pir_conf.threshold)
            *PIR_THRESHOLD_MULTIPLY_FACTOR;
    config_pir.handler = pir_handler;

    mcp4012_set_value(config.config_sensepi->pir_conf.amplification);

    pir_out_gen_config_updater();
    timer_out_gen_config_updater();

    light_sense_set_state(true);
    module_manager_start_check();
}

void sensepi_cam_trigger_add_tick(uint32_t interval)
{
    static uint32_t light_sense_count = 0;

    log_printf("%s\n", __func__);
    log_printf("SensePi Add ticks : %d\n", interval);

    sense_count += interval;
    if(sense_count > SENSE_FEEDBACK_TIMEOUT_TICKS)
    {
        sense_feedback = false;
    }

    light_sense_count += interval;
    if(light_sense_count > LIGHT_SENSE_INTERVAL_TICKS)
    {
        module_manager_start_check();
        light_sense_count = (light_sense_count - LIGHT_SENSE_INTERVAL_TICKS);
    }
}

void sensepi_cam_trigger_stop()
{
    log_printf("%s\n",__func__);
    module_manager_disable_all();
    out_gen_stop((bool *) out_gen_end_all_on);
    led_ui_type_stop_all(LED_UI_SINGLE_SEQ);
}

sensepi_config_t * sensepi_cam_trigger_get_sensepi_config()
{
    log_printf("%s\n", __func__);
    return (config.config_sensepi);
}
